meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "РОФЛ": "Какая то шутка",
            "ВЫГОРАНИЕ": "Когда человек устает от своего дела",
            "НЕФОР": "Когда человек выделяется из основной массы людей, внешность, одежда и тд",
            "КРИПОВЫЙ": "страшный, пугающий"
            }
word = input("Введите непонятное слово (все заглавными буквами!): ")
if word in meme_dict.keys():
    print("Вот значение этого слова: ", meme_dict[word])
else:
    print("Возможно вашего слова пока нету в базе, извините за неудобства")
